
## Plan Result (transactional-emails-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/97317)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.events_sqs-event-consumer_lambda_3BE960B8 will be updated in-place
  ~ resource "aws_lambda_function" "events_sqs-event-consumer_lambda_3BE960B8" {
        id                             = "TransactionalEmails-Prod-Sqs-Event-Consumer-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:TransactionalEmails-Prod-Sqs-Event-Consumer-Function:507" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:TransactionalEmails-Prod-Sqs-Event-Consumer-Function:507/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "TransactionalEmails"
        }
      ~ version                        = "507" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                            = (sensitive value) -> null
                # (7 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + events_sqs-event-consumer_lambda-code-deploy_lambda_codedeploy_app_83BEE3FD   = "TransactionalEmails-Prod-Sqs-Event-Consumer-Lambda"
  + events_sqs-event-consumer_lambda-code-deploy_lambda_codedeploy_group_2E68B05A = "TransactionalEmails-Prod-Sqs-Event-Consumer-Lambda"
  + events_sqs-event-consumer_lambda_lambda_arn_2A8C2381                          = "arn:aws:lambda:us-east-1:996905175585:function:TransactionalEmails-Prod-Sqs-Event-Consumer-Function"
  + events_sqs-event-consumer_lambda_lambda_function_name_1AEF8887                = "TransactionalEmails-Prod-Sqs-Event-Consumer-Function"
  + events_sqs-event-consumer_lambda_lambda_version_arn_B3E731F1                  = "arn:aws:lambda:us-east-1:996905175585:function:TransactionalEmails-Prod-Sqs-Event-Consumer-Function:DEPLOYED"
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"01740af5-00cb-49ae-b1db-4387fbe53c8d","JobName":"transactional-emails_infrastructure_plan_prod","PRNumber":329,"Program":"tfcmt","SHA1":"63ab645f13cf50a53b56a8235344fc45f0b9c23b","Target":"transactional-emails-cdk","Vars":{}} -->